// Оператор остатка дает %остаток от деления двух чисел.
// 5 % 2 = 1
// 5/2 = 2 остаток 1
// 2 * 2 = 4
// 5 - 4 = 1
// Использование
// В математике четность или нечетность числа можно проверить, проверив остаток от деления числа на 2. Чётные числа имеют остаток 0, а нечётные числа — остаток 1.
// 17 % 2 = 1
// 48 % 2 = 0
// Примечание. Оператор остатка иногда ошибочно называют оператором модуля. Он очень похож на модуль, но не работает должным образом с отрицательными числами.
const remainder = 11%3;// = остаток 2